main.floors.a=
{
"floorId": "a",
"title": "小学",
"name": "0",
"width": 13,
"height": 13,
"canFlyTo": true,
"canUseQuickShop": true,
"images": [],
"item_ratio": 2,
"defaultGround": "ground",
"bgm": "bgm.mp3",
"firstArrive": [],
"events": {
    "4,2": [
        "恭喜wcpzzz同学，以288分年级第一的成绩，于2008年6月毕业。望再接再厉，为母校争光。",
        {
            "type": "hide",
            "time": 500
        }
    ],
    "8,4": null,
    "7,2": [
        "\t[老师,woman]山外青山天外天，庆幸吧你含着红钥匙出生了，若是去了隔壁江苏，不知你还能不能笑得这么灿烂。",
        "\t[wcpzzz,hero]去了也没关系，我倒还希望考得难一点，不然分不出差距！【心高气傲】",
        "\t[老师,woman]呵呵……【迷之微笑】",
        {
            "type": "hide",
            "time": 500
        }
    ],
    "8,2": null,
    "6,11": [
        "上海宝山罗南小村"
    ]
},
"changeFloor": {
    "3,2": {
        "floorId": "b",
        "loc": [
            6,
            10
        ],
        "time": 500
    }
},
"afterBattle": {
    "8,4": null,
    "8,3": [
        "\t[wcpzzz]一群绿皮菜鸡！一个能打的都没有！老子是天才！老子是天下第一！哈哈哈哈哈哈！\n\nenter继续"
    ]
},
"afterGetItem": {
    "8,2": "\t[旁白]大多儿时养成的性格，是会根深蒂固刻在骨子里的。名为好胜的利剑，将陪伴wcpzzz今后坎坷的征程。\n\nenter继续"
},
"afterOpenDoor": {},
"cannotMove": {},
"map": [
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4, 87,129,  0,  0,122, 35,  0,  4,  4,  4],
    [  4,  4,  4,  1,225,  1, 85,  1,201,  1,  4,  4,  4],
    [  4,  4,  4,  1,204,  1,  0,  1,201,  1,  4,  4,  4],
    [  4,  4,  4,  1,204,  1,  0,  1,201,  1,  4,  4,  4],
    [  4,  4,  4,  1,204,  1,  0,  1,201,  1,  4,  4,  4],
    [  4,  4,  4,  1,204,  1,  0,  1,201,  1,  4,  4,  4],
    [  4,  4,  4,  1,204,  1,  0,  1,201,  1,  4,  4,  4],
    [  4,  4,  4,  1, 81,  1, 85,  1, 83,  1,  4,  4,  4],
    [  4,  4,  4,  4,  0,  0,  0,  0, 23,  4,  4,  4,  4],
    [  4,  4,  4,  4,  0,  0,129,  0,  0,  4,  4,  4,  4],
    [  4,  4,  4,  4,  0,  0,  0,  0,  0,  4,  4,  4,  4]
],
"bgmap": [

],
"fgmap": [

],
"cannotViewMap": true,
}