main.floors.c=
{
"floorId": "c",
"title": "高中",
"name": "0",
"width": 13,
"height": 13,
"canFlyTo": true,
"canUseQuickShop": true,
"images": [],
"item_ratio": 2,
"defaultGround": "ground",
"bgm": "bgm.mp3",
"firstArrive": [],
"events": {
    "7,11": null,
    "6,11": null,
    "4,7": null,
    "4,9": null,
    "4,3": null,
    "4,2": [
        {
            "type": "if",
            "condition": "flag:flag_times==0",
            "true": [
                "\t[旁白]很不幸，wcpzzz在高考中受极端压力影响，未能发挥出自己的实力，大脑思维在紧张中被极度压缩，似cpu死锁……",
                "\t[wcpzzz,hero]……",
                "\t[wcpzzz,hero]……………………",
                "\t[旁白]无尽的沉默中，wcpzzz的眼神黯淡了，但却没有哭，因为，觉得很掉价。",
                "\t[wcpzzz,hero]再考一次吧。再怎么说，这点二本的分也太可耻了。",
                "\t[旁白]wcpzzz没有接下成绩单，复考之门开启，自我意识彻底觉醒。",
                {
                    "type": "setValue",
                    "name": "flag:door1",
                    "value": "flag:door1+1"
                },
                {
                    "type": "if",
                    "condition": "flag:door1==1",
                    "true": [
                        {
                            "type": "openDoor",
                            "loc": [
                                6,
                                9
                            ]
                        },
                        {
                            "type": "openDoor",
                            "loc": [
                                6,
                                3
                            ]
                        }
                    ],
                    "false": []
                }
            ],
            "false": [
                "\t[wcpzzz]重考吧，无论如何，不甘心。",
                {
                    "type": "exit"
                }
            ]
        },
        {
            "type": "setValue",
            "name": "flag:flag_times",
            "value": "flag:flag_times+1"
        },
        {
            "type": "revisit"
        }
    ],
    "8,2": [
        "\t[谜之声]你当真相信重考一次就可以成功了吗？",
        "\t[wcpzzz,hero]……",
        "\t[谜之声]只是不甘心吧。你也应该意识到了，自己缺失的能力是什么。",
        "\t[wcpzzz,hero]我无法应对超过我能力的事情，越是好强，越会被强敌击垮。我，不擅长考试。",
        "\t[谜之声]做一些自己擅长的事情吧，否则，也就是给前半生的失败多加了一个年轮罢了。",
        {
            "type": "hide",
            "time": 500
        }
    ],
    "4,11": [
        "南京市金陵中学河西分校"
    ],
    "4,10": [
        "\t[wcpzzz,hero]如果我生来平庸，那为何又要我经历幻觉呢？",
        "\t[wcpzzz,hero]如果我生来平庸，那我所做的一切，究竟又有什么意义呢？",
        "\t[wcpzzz,hero]父母张口闭口就是努力，除了努力，他们又知道些什么呢？",
        "\t[wcpzzz,hero]而我，又将独自一人活成如何的模样呢？",
        "\t[旁白]由于工作原因，高中生活中家人几乎未曾wcpzzz在一起生活过。随着长大，渐渐的，wcpzzz有了自己的想法，并察觉到父辈的愚钝，发誓要自立根生，一雪前耻。",
        {
            "type": "hide",
            "time": 500
        }
    ]
},
"changeFloor": {
    "9,2": {
        "floorId": "d",
        "loc": [
            0,
            12
        ],
        "time": 500
    }
},
"afterBattle": {
    "4,3": [
        "\t[金中河西]恭喜wcpzzz同学，战胜了对手，于第三次高考模拟中，取得了年级第二的优异成绩！望高考再接再厉，为母校争光！",
        "\t[wcpzzz,hero]这的确值得恭喜。付出更多的艰辛，这一切，也是我应得的。苍天有眼，天道酬勤啊！",
        "\t[旁白]那一刻，被胜利的喜悦包裹着的wcpzzz并没有意识到问题的严重性，以至于有了自己很适合高考的错觉，并给自己定下了极高乃至几乎不能完成的目标。",
        "\t[wcpzzz,hero]我要上浙江大学！"
    ],
    "4,8": [
        "获得了爆种之剑。"
    ],
    "4,6": [
        "获得了封闭之盾。"
    ],
    "4,5": [
        "\t[wcpzzz,hero]我可以的，就算在这个地方，只要我做得题更多，消化的知识更多，自然就能赢下来。并不是我更聪明，而是我的学习策略更好，素养境界更高。"
    ],
    "4,9": [
        "\t[wcpzzz,hero]生而好强，生而不凡，我必须要足够的努力，应该说，咬牙切齿，拼了！",
        "\t[旁白]wcpzzz获得了“爆种”能力，可以忍受极端恶劣的训练，并于高二上学期，主动抛弃了“浪费时间”的各种娱乐活动。",
        "\t[旁白]但也仅此而已。",
        "\t[旁白]wcpzzz并未在学习中获得快乐，甚至恶狠狠的说，这些知识没有价值，若不能换来有价值的文凭，那上半辈子就是白活了！"
    ],
    "4,7": [
        "\t[wcpzzz,hero]我想通了，学校是所牢笼，压榨了所有人的时间，才让那些废物和我平起平坐。",
        "\t[wcpzzz,hero]就是这个地方，强制把所有人的努力都画上了等号。我童年时的一切，都只是好胜心激发的偏执努力产物罢了。\n\n我并不是聪明，只是比常人更努力而已。",
        "\t[wcpzzz,hero]所以，也就是说，在这个地方，我没有任何优势。而我一直引以为傲的品格，也无法在此彰显。",
        "\t[wcpzzz,hero]我需要离开这里，去自学！",
        "\t[旁白]随着思想的深刻，wcpzzz终于理清了这些年成败变迁的来龙去脉，获得了能力“封闭”，自诩着“虽天下人吾往矣”，再不受管教。"
    ]
},
"afterGetItem": {
    "4,8": null
},
"afterOpenDoor": {},
"cannotMove": {},
"map": [
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4, 87,129,  0,  0,  0,137, 87,  4,  4,  4],
    [  4,  4,  4,  1,225,  1, 85,  1, 83,  1,  4,  4,  4],
    [  4,  4,  4,  1,224,  1,  0,  1,204,  1,  4,  4,  4],
    [  4,  4,  4,  1,223,  1,  0,  1,204,  1,  4,  4,  4],
    [  4,  4,  4,  1, 44,  1,  0,  1,204,  1,  4,  4,  4],
    [  4,  4,  4,  1,261,  1,  0,  1,204,  1,  4,  4,  4],
    [  4,  4,  4,  1, 43,  1,  0,  1,204,  1,  4,  4,  4],
    [  4,  4,  4,  1,261,  1, 85,  1, 83,  1,  4,  4,  4],
    [  4,  4,  4,  4,137,  0,  0,  0,  0,  4,  4,  4,  4],
    [  4,  4,  4,  4,129,  0,  0,  0,  0,  4,  4,  4,  4],
    [  4,  4,  4,  4,  0,  0,  0,  0,  0,  4,  4,  4,  4]
],
"bgmap": [

],
"fgmap": [

],
}