main.floors.d=
{
"floorId": "d",
"title": "复读",
"name": "0",
"width": 13,
"height": 13,
"canFlyTo": true,
"canUseQuickShop": true,
"images": [],
"item_ratio": 2,
"defaultGround": "ground",
"bgm": "bgm2.mp3",
"firstArrive": [],
"events": {
    "0,5": [
        "\t[小说人物，张天乐]如果承载了足够的期望，那么，即使在遥远的光亮，也终有一天会邂逅寻找它的仰望，星星是这么对我说的。\n\n所以，我期盼一个温柔的世界。",
        "\t[旁白]那时的wcpzzz虽然仍未真正的开悟，但隐隐中，有一个梦想正在酝酿，心心念念，终有回响。"
    ],
    "3,12": [
        "\t[小说人物，火霜]归去否？一梦尘入土。\n生灵兮，落花嫁红衣。\n待月风霜满回廊，\n魂归何处不家乡？"
    ],
    "4,0": [
        "\t[小说人物，雨纱]信息的交叉确认是最优秀的认知策略，这一点在量子计算中存在影射。\n直到被观测，被确认为止，都应该把思维停留在中间态。\n而最后显现于现实存在的，就会拥有成体系的自洽性。"
    ],
    "7,5": [
        "\t[小说人物，鸢宁]世界就是一道题，唯心者注定与现实相悖。故善恶与动机无关，侵略性与智慧成反比，愚蠢是万恶之源。\n与世无争，避祸求福。这就是我的生存之道。"
    ],
    "9,0": [
        "\t[小说人物，明烁]完全听不懂你在说什么东西。坦白一下，我就是肤浅的人。因此，我相信你，相信智者的力量。所以鸢宁，偶尔也开心一点嘛，就算你自己不觉得苦，但也要知道会有人为你心痛呀。"
    ],
    "7,12": [
        "\t[小说人物，祝温]曾经沧海难为水，除却巫山不是云。如果没有遇见各位……呵，好歹我也算普通人里的佼佼者。\n但我不后悔，即便听起来是不可思议的梦想。"
    ],
    "11,10": [
        "\t[wcpzzz,hero]一模二模都考得不错，在家自习也没有落下，作文水平也有了长足的提高，比去年水平稳定多了，嗯……虽然依旧没什么自信面对高考。但是吧，总不至于太凄惨。",
        "\t[谜之声]不，你还是没有解决真正的问题。你心里一定是知道的。",
        "\t[wcpzzz,hero]不，我不知道！",
        "\t[谜之声]激进主义是一把双刃剑。没有平和之力，高考环境一定会封印你的所有力量，就如去年一般。",
        "\t[wcpzzz,hero]只要有碾压试卷的实力就可以了。",
        "\t[旁白]wcpzzz的内心早已预见了未来，就如心声所述，wcpzzz这一年并没有任何的长进。在若干年之后回想往事时，才发现当初的自己只是南辕北辙，越努力，越会有不切实际的妄想，越会因为妄想和不甘心，在最后的最后，绷断心弦。",
        {
            "type": "hide",
            "time": 500
        }
    ],
    "12,1": [
        "很遗憾，真的很遗憾。你以324分，物理b+化学a的成绩，被重庆三峡学院信息管理与信息系统专业录取了。",
        "\t[wcpzzz,hero]……",
        "\t[wcpzzz,hero]………………",
        "\t[wcpzzz,hero]…………………………………………",
        "\t[旁白]当时究竟有没有偷偷哭过，或者偷偷啜泣没有出声，我已经记不得了。",
        "\t[旁白]一路孤单，最勤奋，最拼命，铅笔的错题本擦过一遍又一遍，一张张综合卷上的印记，也都一并成了委屈。",
        "\t[旁白]当时究竟有没有偷偷哭过，或者偷偷啜泣没有出声呢？再问一遍，我也没有任何的答案。因为除我之外，也并没有对我有怎样的期望。像是讽刺一般，说着我也就这点程度，说着我这种懒人，这种不用功的人，就算聪明，又怎么可能……",
        "\t[旁白]突然想起了这样一句话。你这么好的脾气，究竟是曾受过多大的委屈呢？",
        "\t[旁白]总之，那时候我就想，不蜕变不行了，不正视现实不行了。我自然是聪明的，可以心算两位数乘法，也可以听着曲调在键盘上摸出音准，唱歌好听，文采也好，不抱怨，不贪玩，最得意的是爆种时的执行力……",
        "\t[旁白]然而呢，就像正弦函数一样，激进主义扬起的顶峰，总和牺牲的缺口一一相对。",
        "\t[旁白]我不行的。至少，那个时候的我，完全称不上优秀。想着剑走偏锋的天才也大多没有什么好结局。所以便释然，再往后，渐渐黯淡，渐渐地，任自漂流了一段不算太短也不算太长的时光……",
        {
            "type": "hide",
            "time": 500
        }
    ],
    "0,4": null,
    "1,11": [
        "2015至2016，在家自学复读，无人监督。"
    ]
},
"changeFloor": {
    "12,0": {
        "floorId": "e",
        "loc": [
            0,
            12
        ],
        "time": 500
    }
},
"afterBattle": {},
"afterGetItem": {
    "0,10": [
        "\t[wcpzzz,hero]并没有去学校复读的我，想了很久，终究决定写些什么，或者做些什么可以留存下来的事情。",
        "\t[wcpzzz,hero]想写本小说，写一些对生活的理解，写一个理想中的世界。",
        "\t[wcpzzz,hero]这样的话，就不怕孤单了。"
    ]
},
"afterOpenDoor": {},
"cannotMove": {},
"map": [
    [  0,  0,  0,  0,135,  0,  0,  1,  0,134,  0,  1, 87],
    [  0,  1,  1,  1,  0,  1,  0,  1,  0,  1,  0,  1,129],
    [  0,  0,  0,  1,  1,  1,  0,  1,  0,  1,  0,  1,  0],
    [  0,  1,  0,  1,  0,  0,  0,  1,  0,  1,  0,  1,  0],
    [  0,  1,  0,  1,  0,  1,  0,  1,  0,  0,  0,  1,  0],
    [123,  1,  0,  1,  0,  1,  0,136,  0,  1,  0,  1,  0],
    [  0,  0,  0,  0,  0,  1,  0,  0,  0,  1,  0,  1,  0],
    [  0,  1,  0,  1,  0,  1,  0,  1,  1,  1,  0,  1,  0],
    [  0,  1,  0,  1,  0,  1,  0,  1,  0,  0,  0,  1,  0],
    [  0,  1,  1,  1,  0,  0,  0,  1,  0,  1,  0,  1,  0],
    [ 45,  0,  0,  1,  0,  1,  0,  1,  0,  1,  0,137,  0],
    [  0,129,  0,  1,  0,  1,  0,  1,  0,  1,  0,  1,  1],
    [  0,  0,  0,124,  0,  1,  0,128,  0,  0,  0,  0,  0]
],
"bgmap": [

],
"fgmap": [

],
}