main.floors.e=
{
"floorId": "e",
"title": "大学",
"name": "0",
"width": 13,
"height": 13,
"canFlyTo": true,
"canUseQuickShop": true,
"images": [],
"item_ratio": 2,
"defaultGround": "sand",
"bgm": "bgm2.mp3",
"firstArrive": [],
"events": {
    "0,4": [
        "\t[酝酿中的理想]渐进主义，趋势真理，策略正反馈，自洽性……",
        "\t[酝酿中的理想]渐渐不讲人话了，哈哈哈。不过总该有个伟大的理想吧，将知识和经验整理传承下去，是一等要紧的事。趁着年少，把这些写成文档吧。",
        "\t[酝酿中的理想]说来我那70万字的小说也不是全然无用的呢，随人生进度修改着，很像成长啊，偶尔拿出了也有可以显摆的东西（笑）。"
    ],
    "1,4": [
        "\t[理想进行时·未来职业]程序员应该是最适合我的职业了，准确点说，搞程序的人群比较聪明，天天和代码bug做斗争的人，一般都与人为善。而且啊，程序是传承，是未来。",
        "\t[理想进行时·未来职业]所以，拿着不咋地的文凭，摸爬滚打不要脸我都得进这行（笑），然后争取进人工智能领域（严肃脸）。"
    ],
    "2,4": [
        "\t[理想进行时·资料共享]大学的话，也不知道那些天天打游戏的人怎么个想法。所以，没有实际工作总是不行的。所以，不和更多正在学习的人交流是不行的……",
        "\t[理想进行时·资料共享]所以，就做个学习交流区吧。就拿wps云共享，然后和好伙伴一起传传经验文档，传传深刻的，不方便与人长篇大论的内容，这样的话，如果相互瞧见了，也可以大聊特聊吧。完美。"
    ],
    "3,4": [
        "\t[理想进行时·传承]从年轻时代起，就该构架具有自洽性的特色唯物世界观和方法论，整理人生轨迹，不断分析，然后思考如何将真正正确的东西传承下去。毕竟世上充斥着太多不正确的道理，清浊之辨总该有人指引后辈。",
        "\t[理想进行时·传承]姑且先记录几句喜欢的名言。人无远虑，必有近忧。淡泊明志，宁静致远。"
    ],
    "4,4": [
        "待续"
    ],
    "5,4": [
        "待续"
    ],
    "7,4": [
        "待续"
    ],
    "6,3": [
        "\t[自言自语]尝试面试看看吧。想来一页白纸没有什么好看的，假装放几个工程，也不过就是Github上down的，或者跟着教学视频……白纸就是白纸啦，但也不能太掉价，所以就……",
        "\t[自言自语]挺好的，这玩意可以做一辈子，和人相处也方便展示出自己有趣的部分，教小孩的时候，也……嘛，反正我得当程序员，超喜欢这个职业，码一天代码都开心，codecombat玩得不亦乐乎。",
        {
            "type": "hide",
            "time": 500
        }
    ],
    "0,0": [
        "第一份工作，待续。"
    ],
    "1,11": [
        "重庆三峡学院"
    ]
},
"changeFloor": {},
"afterBattle": {},
"afterGetItem": {},
"afterOpenDoor": {},
"cannotMove": {},
"map": [
    [125,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  1,  1,  1,  1,  1,  1,137,  1,  1,  1,  1,  1,  1],
    [137,133,134,136,135,123,  0,127,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0, 20, 20, 20, 20,  0,  0,  0,151,151,151,151,  0],
    [  0, 20, 20, 20, 20,  0,  0,  0,151,151,151,151,  0],
    [  0, 20, 20, 20, 20,  0,  0,  0,151,151,151,151,  0],
    [  0, 20, 20, 20, 20,  0,  0,  0,151,151,151,151,  0],
    [  0,129,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
"bgmap": [

],
"fgmap": [

],
}